config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
