config.el

(setq catppuccin-flavor 'frappe) ;; 'frappe or 'latte, 'macchiato, or 'mocha
(setq catppuccin-highlight-matches t)
(setq catppuccin-italic-comments t)
(setq catppuccin-italic-blockquotes t)
(setq doom-theme 'catppuccin)
(add-hook 'server-after-make-frame-hook #'catppuccin-reload)

(setq doom-themes-treemacs-theme "doom-colors")

(global-hl-todo-mode)

(add-hook 'pdf-view-mode-hook #'pdf-view-themed-minor-mode)

(display-battery-mode)
(display-time-mode)
(timeclock-mode-line-display)

(setq display-line-numbers-type t)

(setq fancy-splash-image (concat doom-user-dir "TransparentGNU_catpuccin.png"))
(setq +doom-dashboard-banner-dir doom-user-dir )
(setq +doom-dashboard-banner-file "TransparentGNU_catpuccin.png")

(setq evil-snipe-scope 'visible)

(after! dirvish
  (setq dirvish-quick-access-entries '(
                                       ("h" "~/" "Home")
                                       ("d" "~/Documents" "Documents")
                                       ("o" "/ssh:don-elias:/home/mbarria" "don-elias")
                                       ("i" "/ssh:diego-armando:/home/mbarria" "diego-armando")
                                       ("a" "/ssh:chamaco:/home/mbarria" "chamaco")
                                       ("u" "/ssh:chupete:/home/mbarria" "chupete")
                                       ("n" "~/org" "Org-mode")
                                       )))

(use-package! org-latex-preview
  :config
  ;; Increase preview width
  (plist-put org-latex-preview-appearance-options
             :page-width 1.0)

  ;; Use dvisvgm to generate previews
  ;; You don't need this, it's the default:
  (setq org-latex-preview-process-default 'dvisvgm)

  ;; Turn on auto-mode, it's built into Org and much faster/more featured than
  ;; org-fragtog. (Remember to turn off/uninstall org-fragtog.)
  (add-hook 'org-mode-hook 'org-latex-preview-auto-mode)

  ;; Block C-n, C-p etc from opening up previews when using auto-mode
  (setq org-latex-preview-auto-ignored-commands
        '(next-line previous-line mwheel-scroll
          scroll-up-command scroll-down-command))

  ;; Enable consistent equation numbering
  (setq org-latex-preview-numbered t)

  ;; Bonus: Turn on live previews.  This shows you a live preview of a LaTeX
  ;; fragment and updates the preview in real-time as you edit it.
  ;; To preview only environments, set it to '(block edit-special) instead
  (setq org-latex-preview-live t)

  ;; More immediate live-previews -- the default delay is 1 second
  (setq org-latex-preview-live-debounce 0.25))

(setq org-directory "~/org/")
(setq +org-capture-inbox-file (doom-path org-directory "agenda/!nbox.org"))
(setq +org-capture-projects-file (doom-path org-directory "agenda/projects.org"))
(setq +org-capture-todo-file (doom-path org-directory "agenda/todo.org"))
(setq +org-capture-toread-file (doom-path org-directory "agenda/toread.org"))
;; (setq +org-capture-notes-file (doom-path org-directory "!nbox.org"))
;; timestamp DONEs
(setq org-log-done 'time)
(after! org (setq org-agenda-files (list "~/org/agenda/!nbox.org"
                                         "~/org/agenda/todo.org"
                                         "~/org/agenda/done.org"
                                         "~/org/agenda/projects.org"
                                         "~/org/agenda/someday.org"
                                         "~/org/agenda/toread.org"
                                         "~/org/agenda/meetings.org")))

(after! org
  (setq org-capture-templates
        '(("i" "Inbox"
