config.org
**** Templates

Capture templates:
+ i: Inbox. Everything that comes from outside the inbox should go here first.
+ s: Work-log/Lab Notebook: Record results so that they are easy to report later.
+ t: General todo. For tasks from the inbox that take more than two minutes.
+ e: Email. For when an email requires some task before replying.
+ p: Creating new projects.
+ m: Taking notes of Meetings.

#+begin_src elisp :tangle config.el
(after! org
  (setq org-capture-templates
        '(("i" "Inbox"
           entry (file +org-capture-inbox-file)
           "* TODO %?\n:Created: %T\n%i\n%a"
           :prepend t
           :empty-lines 0)
          ("t" "General To-Do"
           entry (file+headline +org-capture-todo-file "Actions")
           "* TODO [#B] %?\n:Created: %T\n%i\n%a"
           :prepend t
           :empty-lines 0)
          ("e" "Email"
           entry (file+headline +org-capture-todo-file "Emails")
           "* TODO [#B] %? :email: \n:Created: %T\n** Correspondent(s)\n***\n** Notes\n** Sub-actions \n%a"
           :prepend t
           :empty-lines 0)
          ("s" "Lab Work-Log"
           entry (file+datetree +org-capture-work-log-file)
           "* %? \n %a"
           :prepend nil
           :tree-type week
           :empty-lines 0)
          ("p" "Project"
           entry (file +org-capture-projects-file)
           "* PROJ [#B] %?\n:Created: %T\n** Collaborators(s)\n***\n** Notes\n** [0%]Actions \n*** TODO\n%a"
           :prepend t
           :empty-lines 0)
          ;; Reading List
          ("r" "Paper"
           entry (file+headline +org-capture-toread-file "Scientific Articles")
           "* TODO [#B] %?\n:Created: %T\n** Author(s)\n***\n** Notes\n** Metadata \n*** URL: \n*** DOI: \n*** Magazine: \n***Discussion: \n%a"
           :prepend t
           :empty-lines 0)
          ("m" "Meeting"
           entry (file+datetree "~/org/agenda/meetings.org")
           "* %? :meeting:%^g \n:Created: %T\n** Attendees\n*** \n** Notes\n** Action Items\n*** TODO [#A] "
           :tree-type week
           :empty-lines 0))))

;; Define a function for capturing to Inbox
(defun org-capture-inbox ()
  (interactive)
  (call-interactively 'org-store-link)
  (org-capture nil "i"))
;; Specific Capture for Inbox + Shortcut to inbox file
(map! :map doom-leader-notes-map
      :desc "Capture to Inbox" "i" #'org-capture-inbox
      ;; :desc "Open Inbox" "I"  (cmd! (find-file +org-capture-inbox-file))
      )
#+end_src

#+RESULTS:



**** Priorities
#+begin_src elisp :tangle config.el
(after! org-fancy-priorities
  (setq org-fancy-priorities-list '((?A . "🔴")
                                  (?B . "🟠")
                                  (?C . "🟢"))))
#+end_src


**** Tags

From a headline or body, use ~SPC m q~ to set tags from this list.
#+begin_src elisp :tangle config.el
(setq org-tag-alist '(
                      ;; ;; Ticket types
                      ;; (:startgroup . nil)
                      ;; ("@bug" . ?b)
                      ;; ("@feature" . ?f)
                      ;; (:endgroup . nil)

                      ;; ;; Ticket flags
                      ;; ("@emergency" . ?e)
                      ;; ("@research" . ?r)

                      ;; ;; Special tags
                      ;; ("CRITICAL" . ?x)
                      ;; ("obstacle" . ?o)

                      ;; Meeting tags
                      ("meeting" . ?m)
                      ("misc" . ?z)
                      ("planning" . ?p)
                      ("progress" . ?s)

                      ;; Context Tags
                      (:startgroup . nil)
                      ("personal" . ?g)
                      ("work" . ?t)
                      ("phone" . ?c)
                      (:endgroup . nil)

                      ;; ;; Work Log Tags
                      ;; ("accomplishment" . ?a)
                      ))
;; Tag colors
(setq org-tag-faces
      '(
        ("work"  . (:foreground "mediumPurple1" :weight bold))
        ("planning"   . (:foreground "royalblue1"    :weight bold))
        ("progress"  . (:foreground "forest green"  :weight bold))
        ("personal"        . (:foreground "sienna"        :weight bold))
        ("meeting"   . (:foreground "yellow1"       :weight bold))
        )
      )
#+end_src


