config.org
**** Agenda View

Agenda view

#+begin_src elisp :tangle config.el
;; Agenda View "d"
(defun air-org-skip-subtree-if-priority (priority)
  "Skip an agenda subtree if it has a priority of PRIORITY.

  PRIORITY may be one of the characters ?A, ?B, or ?C."
  (let ((subtree-end (save-excursion (org-end-of-subtree t)))
        (pri-value (* 1000 (- org-lowest-priority priority)))
        (pri-current (org-get-priority (thing-at-point 'line t))))
    (if (= pri-value pri-current)
        subtree-end
      nil)))

(setq org-agenda-skip-deadline-if-done t)

(after! org-agenda
  (setq org-agenda-custom-commands
        '(
          ;; Daily Agenda & TODOs
          ("d" "Daily agenda and Next Actions"

           ;; Display items with priority A
           ((tags-todo "PRIORITY=\"A\"+Actions-Someday+work"
                       ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                        (org-agenda-overriding-header "High-priority unfinished tasks:")))

            ;; View 7 days in the calendar view
            (agenda "" ((org-agenda-span 7)))

            ;; Display items with priority B (really it is view all items minus A & C)
            (tags-todo "+Actions-Someday+work"
                       ((org-agenda-skip-function '(or (air-org-skip-subtree-if-priority ?A)
                                                       (air-org-skip-subtree-if-priority ?C)
                                                       (org-agenda-skip-if nil '(scheduled deadline))))
                        (org-agenda-overriding-header "ALL normal priority tasks:")))

            ;; Display items with pirority C
            (tags-todo "PRIORITY=\"C\"+Actions-Someday+work"
                       ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                        (org-agenda-overriding-header "Low-priority Unfinished tasks:")))
            )

           ;; Don't compress things (change to suite your tastes)
           ((org-agenda-compact-blocks nil)))

          ;; GTD Inbox Tray
          ("i" "Inbox"

           ;; Display TODO items tagged as inbox_tray
           ((tags-todo "+inbox_tray"
                       ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                        (org-agenda-overriding-header "Inbox")))

            ))

          ;; Personal TODOs
          ("p" "Personal"

           ;; Display TODO items tagged as inbox_tray
           ((tags-todo "+personal"
                       ((org-agenda-overriding-header "Personal")))

           ))


        ("j" "Someday"

         ;; Display items with priority A
         ((tags-todo "PRIORITY=\"A\"+Someday"
                     ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                      (org-agenda-overriding-header "High-priority unfinished tasks:")))

          ;; Display items with priority B (really it is view all items minus A & C)
          (tags-todo "+Someday"
                     ((org-agenda-skip-function '(or (air-org-skip-subtree-if-priority ?A)
                                                     (air-org-skip-subtree-if-priority ?C)
                                                     (org-agenda-skip-if nil '(scheduled deadline))))
                      (org-agenda-overriding-header "ALL normal priority tasks:")))

          ;; Display items with pirority C
          (tags-todo "PRIORITY=\"C\"+Someday"
                     ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                      (org-agenda-overriding-header "Low-priority Unfinished tasks:")))
          )

         ;; Don't compress things (change to suite your tastes)
         ((org-agenda-compact-blocks nil)))


        )))
#+end_src

#+RESULTS:
| d | Daily agenda and Next Actions | ((tags-todo PRIORITY="A"+Actions-Someday ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done)) (org-agenda-overriding-header High-priority unfinished tasks:))) (agenda  ((org-agenda-span 7))) (tags-todo +Actions-Someday ((org-agenda-skip-function '(or (air-org-skip-subtree-if-priority 65) (air-org-skip-subtree-if-priority 67) (org-agenda-skip-if nil '(scheduled deadline)))) (org-agenda-overriding-header ALL normal priority tasks:))) (tags-todo PRIORITY="C"+Actions-Someday ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done)) (org-agenda-overriding-header Low-priority Unfinished tasks:)))) | ((org-agenda-compact-blocks nil)) |
| i | Inbox                         | ((tags-todo +inbox_tray ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done)) (org-agenda-overriding-header Inbox))))                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             |                                   |
| j | Someday                       | ((tags-todo PRIORITY="A"+Someday ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done)) (org-agenda-overriding-header High-priority unfinished tasks:))) (tags-todo +Someday ((org-agenda-skip-function '(or (air-org-skip-subtree-if-priority 65) (air-org-skip-subtree-if-priority 67) (org-agenda-skip-if nil '(scheduled deadline)))) (org-agenda-overriding-header ALL normal priority tasks:))) (tags-todo PRIORITY="C"+Someday ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done)) (org-agenda-overriding-header Low-priority Unfinished tasks:))))                                                         | ((org-agenda-compact-blocks nil)) |


**** Refiling
Let's make it so that refiling leaves some mark.
Useful for refilign from meetings to projects.
But with an exception for the inbox.
#+begin_src elisp :tangle config.el
(defun org-refile--insert-link ( &rest _ )
  (unless (string-suffix-p "!nbox.org" buffer-file-name)
    (org-back-to-heading)
    (let* ((refile-region-marker (point-marker))
           (source-link (org-store-link nil)))
      (org-insert-heading)
      (insert source-link)
      (goto-char refile-region-marker))))
#+end_src
