packages.el
(package! org-roam-ui)

(package! ob-async
  :recipe (:host github
           :repo "astahlman/ob-async"))

(package! git-auto-commit-mode)
