config.org
*** Auto update lastmod
Update property ~lastmod~ when saving files.
From [[https://org-roam.discourse.group/t/update-a-field-last-modified-at-save/321/5][Zaeph]]
#+begin_src elisp :tangle config.el
  ;;--------------------------
  ;; Handling file properties for ‘CREATED’ & ‘LAST_MODIFIED’
  ;;--------------------------

  (defun zp/org-find-time-file-property (property &optional anywhere)
    "Return the position of the time file PROPERTY if it exists.

When ANYWHERE is non-nil, search beyond the preamble."
    (save-excursion
      (goto-char (point-min))
      (let ((first-heading
             (save-excursion
               (re-search-forward org-outline-regexp-bol nil t))))
        (when (re-search-forward (format "^#\\+%s:" property)
                                 (if anywhere nil first-heading)
                                 t)
          (point)))))

  (defun zp/org-has-time-file-property-p (property &optional anywhere)
    "Return the position of time file PROPERTY if it is defined.

As a special case, return -1 if the time file PROPERTY exists but
is not defined."
    (when-let ((pos (zp/org-find-time-file-property property anywhere)))
      (save-excursion
        (goto-char pos)
        (if (and (looking-at-p " ")
                 (progn (forward-char)
                        (org-at-timestamp-p 'lax)))
            pos
          -1))))

  (defun zp/org-set-time-file-property (property &optional anywhere pos)
    "Set the time file PROPERTY in the preamble.

When ANYWHERE is non-nil, search beyond the preamble.

If the position of the file PROPERTY has already been computed,
it can be passed in POS."
    (when-let ((pos (or pos
                        (zp/org-find-time-file-property property))))
      (save-excursion
        (goto-char pos)
        (if (looking-at-p " ")
            (forward-char)
          (insert " "))
        (delete-region (point) (line-end-position))
        (let* ((now (format-time-string "[%Y-%m-%d %a %H:%M]")))
          (insert now)))))

  (defun zp/org-set-last-modified ()
    "Update the LAST_MODIFIED file property in the preamble."
    (when (derived-mode-p 'org-mode)
      (zp/org-set-time-file-property "lastmod")))


#+end_src

#+RESULTS:
*** el-secretario

[[https://sr.ht/~zetagon/el-secretario/][el-secretario]] handles to-do reminders and reviews.
#+begin_src elisp :tangle packages.el
(package! el-secretario)
(package! el-secretario-org)
(package! el-secretario-mu4e)
(package! el-secretario-elfeed)
#+end_src

It needs some config, but that's because it's meant to be a very personalized experience.
First for review functions:
#+begin_src elisp :tangle config.el
;; Create a function to start the review
(defun el-secretario-daily-review ()
  (interactive)
  (el-secretario-start-session
   (lambda ()
     (list
      ;; Clean up folders
      (el-secretario-files)
      ;; Take care of inbox using the variable
      (el-secretario-org-make-source nil (list +org-capture-inbox-file))

      ;; Go through TODOs
      (el-secretario-org-make-source '(todo "TODO") '(list +org-capture-todo-file))))))

(defun el-secretario-inbox-review ()
  (interactive)
  (el-secretario-start-session
   (lambda ()
     (list
      ;; Take care of inbox using the variable
      (el-secretario-org-make-source nil (list +org-capture-inbox-file))
      ))))
#+end_src

Also I'll run my reviews on a timer

#+begin_src elisp :tangle config.el
;; (run-with-idle-timer 300 t (lambda () (unless (org-clocking-p) (el-secretario-daily-review))))
#+end_src

For mapping keybindings in el-secretario reviews, it's recommended to use define-key.

#+begin_src elisp :tangle config.el
(use-package! el-secretario-org
  :after el-secretario
  :config
  (define-key el-secretario-org-keymap
      "a" '("Archive" . org-archive-subtree))
  (define-key el-secretario-org-keymap
      "t" '("Tags" . org-set-tags-command))
  (define-key el-secretario-org-keymap
      "T" '("State" . org-todo))
  (define-key el-secretario-org-keymap
      "u" '("Priority Up" . org-priority-up))
  (define-key el-secretario-org-keymap
      "d" '("Priority Down" . org-priority-down))
  )
#+end_src

But for mapping reviews it should not be a problem.
#+begin_src elisp :tangle config.el
  (map! :map doom-leader-notes-map
        :desc "Daily Review" "d" 'el-secretario-daily-review
        :desc "Inbox Review" "I" 'el-secretario-inbox-review
        )
#+end_src



** Ligatures
*** Julia
Last I checked, the ligatures module doesn't include julia.
So I set those up.
#+begin_src elisp :tangle config.el
;; Julia
(after! julia-mode
  (set-ligatures! 'julia-mode
    ;; Functional
    :lambda        "->"
    :def           "function"
    :composition   "struct"
    :map           "Dict"
    ;; Types
    :null          "Nothing"
    :true          "true"
    :false         "false"
    :int           "Int"
    :float         "Float64"
    :str           "String"
    :bool          "Bool"
    ;; Flow
    :not           "!"
    :in            "in"
    :not-in        "!in"
    :and           "&&"
    :or            "||"
    :for           "for"
    ;; :some          "some keyword"
    :return        "return"
    ;; Other
    :union         "union"
    :intersect     "intersect"
    :pipe          "|>"
    )
  )
#+end_src

** Ledger
The ledger module configures pretty much everything I need. I just add a binding to access my ledger.
#+begin_src elisp :tangle config.el
(map! :map doom-leader-notes-map
      :desc "Ledger" "e" (cmd! (find-file (doom-path org-directory "agenda/ledger.org"))))
#+end_src

** \LaTeX
I like how tex-fold looks, but I find it weird that it only recognizes the base ~\\cite~ command.

#+begin_src elisp :tangle config.el
(after! tex-fold
  (add-to-list 'TeX-fold-macro-spec-list '("[c]" ("cite" "bibitem" "citep" "citet" "autocite" "fullcite")))
  )
#+end_src


** mu4e
mu4e requires some external config. The docs for the Doom module are really helpful and without them I couldn't have set it up for myself.

My config is nothing special.

#+begin_src elisp :tangle config.el
;; Each path is relative to the path of the maildir you passed to mu
(set-email-account! "gmail"
                    '((mu4e-sent-folder       . "/gmail/[Gmail]/Enviados")
                      (mu4e-drafts-folder     . "/gmail/[Gmail]/Borradores")
                      (mu4e-trash-folder      . "/gmail/[Gmail]/Papelera")
                      (mu4e-refile-folder     . "/gmail/[Gmail]/Todos")
                      (smtpmail-smtp-user     . "mateobarria@gmail.com")
                      (user-mail-address      . "mateobarria@gmail.com")    ;; only needed for mu < 1.4
                      (mu4e-compose-signature . "---\nSaludos,\n\nMateo Barría\n\n(Sent with Mu4e)"))
                    t)

(setq org-msg-signature "\nMateo Barria-Urenda\n\n(Sent with Mu4e+Org-msg)")

(setq +mu4e-gmail-accounts '(("mateobarria@gmail.com" . "/mateobarria")))
;; don't need to run cleanup after indexing for gmail
(setq mu4e-index-cleanup nil
      ;; because gmail uses labels as folders we can use lazy check since
      ;; messages don't really "move"
      mu4e-index-lazy-check t)
(setq mu4e-update-interval 60)
;; Set default search to my inbox; as that is what I prioritize keeping clean
(after! mu4e
    (add-to-list 'mu4e-bookmarks '(:name "Inbox" :query "maildir:/gmail/INBOX" :key 105 :favorite t))
    (mu4e-modeline-mode))
;; Show it in modeline
#+end_src
** Julia
While I'm most proficient with Python, I'm trying to switch to Julia whenever possible.

*** LSP Configuration

Tell ~lsp-julia~ where ~LanguageServer~ is explicitly

#+begin_src elisp :tangle config.el

(after! lsp-julia
  (setq lsp-julia-package-dir nil)
  (setq lsp-julia-default-environment "~/.julia/environments/v1.10"))
#+end_src

#+RESULTS:
: ~/.julia/environments/v1.10

** projectile

#+begin_src elisp :tangle config.el

(after! projectile
 (setq projectile-project-search-path '("~/Projects/" "~/Code/" ("~/Lab" . 1))) )
#+end_src
** Shell
Set vterm to nushell
#+begin_src elisp :tangle config.el
(setq nu--path  "/etc/profiles/per-user/mbarria/bin/nu")
(if (file-exists-p nu--path)
    (setq vterm-shell nu--path))
#+end_src

*** Multi Vterm
Multiple Vterms. I've decided to map multi-vterm to ~SPC v~.
#+begin_src elisp :tangle packages.el
(package! multi-vterm)
#+end_src

#+begin_src elisp :tangle config.el
(use-package! multi-vterm
  :config
  (setq multi-vterm-dedicated-window-height-percent 33))

(after! multi-vterm
  (map! :leader
        (:prefix-map ("v" . "vterm")
         :desc "Dedicated Terminal"  "o" 'multi-vterm-dedicated-toggle
         :desc "New terminal" "v" 'multi-vterm
         :desc "Next" "n" 'multi-vterm-next
         :desc "Previous" "p" 'multi-vterm-prev
         :desc "Project" "P" 'multi-vterm-project
         :desc "Rename" "r" 'multi-vterm-rename-buffer
         )))
#+end_src

#+RESULTS:
: multi-vterm-project

*** TRAMP Shell
By default, only a default shell for docker is specified.
I specify one for ssh (bash).
#+begin_src elisp :tangle config.el
(setq vterm-tramp-shells '(("ssh" "/bin/bash") ("docker" "/bin/sh")))
#+end_src

