config.org
** pandoc
Take advantage of [[https://pandoc.org/][Pandoc]] to never leave org-mode!

#+begin_src elisp :tangle packages.el
(package! org-pandoc-import
  :recipe (:host github
           :repo "tecosaur/org-pandoc-import"
           :files ("*.el" "filters" "preprocessors")))
(package! ox-pandoc)
#+end_src

#+begin_src elisp :tangle config.el
(use-package! org-pandoc-import :after org)
(use-package! ox-pandoc :after org)
#+end_src
** elfeed
The RSS module already installs elfeed and sets it up to configure with an ~elfeed.org~ file in your ~org~ folder. But I want some more features and syncing the database with syncthing.

#+begin_src elisp :tangle packages.el
(package! elfeed-protocol)
(package! elfeed-score)
#+end_src

#+begin_src elisp :tangle config.el
(after! elfeed
  (setq elfeed-db-directory "~/.elfeed-data")
  (add-hook 'elfeed-search-mode-hook #'elfeed-update))


(use-package! elfeed-protocol
  :after elfeed
  :config
  (setq elfeed-curl-extra-arguments '("--insecure"))
  ;; setup feeds
  (setq elfeed-protocol-feeds '(("owncloud+https://admin@nc.mbarria.cl"
                        :use-authinfo t )))

  ;; enable elfeed-protocol
  (setq elfeed-protocol-enabled-protocols '(fever newsblur owncloud ttrss))
  (setq elfeed-protocol-owncloud-maxsize 1000)
  (setq elfeed-protocol-owncloud-update-with-modified-time t)
  (setq elfeed-protocol-owncloud-fetch-category-as-tag t)
  (elfeed-protocol-enable)
  )
#+end_src

* Packages

** Spotify

Possibly peak "I don't want to leave Emacs" for me is controlling Spotify.
These's multiple packages that do this, but I use SnootierMoon's [[https://github.com/SnootierMoon/emacs-spotify][emacs-spotify]].
#+begin_src elisp :tangle packages.el
(package! spotify
  :recipe (:host github
           :repo "SnootierMoon/emacs-spotify"))
#+end_src
Which I bind to it's own prefix map after the Doom leader.
#+begin_src elisp :tangle config.el
(map! :leader
      (:prefix-map ("S" . "Spotify")
       :desc "START"    "s" 'spotify-start
       :desc "Play"     "j" 'spotify-play
       :desc "Pause"    "k" 'spotify-pause
       :desc "Next"     "l" 'spotify-next
       :desc "Previous" "h" 'spotify-prev
       ))
#+end_src
** Pueue
[[https://github.com/Nukesor/pueue][Pueue]] is a super useful tool for running data analysis and other long processes.
I find it very useful to open and add to the queue from Emacs, particularly when working with python/julia scripts.
#+begin_src elisp :tangle packages.el
(package! pueue
  :recipe (:host github
           :repo "xFA25E/pueue"))
#+end_src
I add a binding to the open map too see how everything is doing, and another to the code map to easily add scripts I'm looking at to the queue.
#+begin_src elisp :tangle config.el
;; Pueue
(map! :map doom-leader-open-map
      :desc "Pueue"     "q" 'pueue
      )
(map! :map doom-leader-code-map
      :desc "Add to Pueue"     "q" 'pueue-add
      )
#+end_src
** Beacon
A small but powerfull change: a big beacon of light whenever you switch windows/buffers.
#+begin_src elisp :tangle packages.el
(package! beacon)
#+end_src
Of course, I ant it to be always active.
#+begin_src elisp :tangle config.el
(use-package! beacon
  :config (beacon-mode 1))
#+end_src
** Nyan-mode
Add a bit of life to the modeline.
#+begin_src elisp :tangle packages.el
(package! nyan-mode)
#+end_src

#+begin_src elisp :tangle config.el
(use-package! nyan-mode
  :after doom-modeline
  :config
  (setq nyan-bar-length 15
        nyan-wavy-trail t)
  (nyan-mode)
  (nyan-start-animation))
#+end_src

** Slurm
#+begin_src elisp :tangle packages.el
(package! slurm-mode)
#+end_src

#+begin_src elisp :tangle config.el
(use-package! slurm-mode)

#+end_src

** gptel
Karthink's [[https://github.com/karthink/gptel?tab=readme-ov-file#ollama][LLM client for emacs]]

#+begin_src elisp :tangle packages.el
(package! gtpel
  :recipe (:host github :repo "karthink/gptel"))
#+end_src

#+begin_src elisp :tangle config.el
(use-package! gptel
  :config
  ;; (gptel-make-ollama "Ollama"             ;Any name of your choosing
  ;;   :host "localhost:11434"               ;Where it's running
  ;;   :stream t                             ;Stream responses
  ;;   :models '("llama3.1:latest"))          ;List of models
  ;; Set default
  ;; OPTIONAL configuration
  (setq
   gptel-model 'deepseek-r1
   gptel-default-mode #'org-mode
   gptel-backend (gptel-make-ollama "Ollama"
                   :host "localhost:11434"
                   :stream t
                   :models '(
                             "deepseek-r1"
                             "llama3.1:latest"
                             "deepseek-coder-v2:latest"
                             "mistral:latest"
                             "mistral-nemo:latest"
                             "gemma2:latest"
                             "gemma2:27b"))))

(map! :leader
      (:prefix-map ("l" . "gptel")
       :desc "Dedicated Buffer" "l" 'gptel
       :desc "Menu"  "m"  'gptel-menu
       :desc "Send text"  "s"  'gptel-send
       :desc "Send text (Menu)"  "S"  (cmd! (gptel-send 1))
       :desc "Add/remove region"  "a"  'gptel-add
       :desc "Add file"  "A"  'gptel-add-file
       (:mode (org-mode)
        :desc "Limit to Heading" "h" 'gptel-org-set-topic
        :desc "Set properties" "p" 'gptel-org-set-properties)))
#+end_src

#+RESULTS:
: gptel-rg-set-properties

** whisper
Voice to Text using OpenAI's whisper, locally.

#+begin_src elisp :tangle packages.el
(package! whisper
  :recipe (:host github :repo "natrys/whisper.el"))
#+end_src

#+begin_src elisp :tangle config.el

(use-package! whisper
  :config
  (map! :desc "Voice to Text" :g "C-c i" #'whisper-run)

(defun whisper--break-sentences (n)
  "Put a line break every N sentences."
  (catch 'return
    (while t
      (dotimes (_ n)
        (forward-sentence 1)
        (when (eobp) (throw 'return nil)))
      (insert "\n")
      (when (= (char-after) ?\ )
        (delete-horizontal-space)))))

(add-hook 'whisper-post-process-hook
          (lambda ()
            (whisper--break-sentences 1)))

  )
#+end_src
** Typst
A [[https://typst.app/docs]["markup-based pysetting language"]].

To get it working we use [[https://codeberg.org/meow_king/typst-ts-mode/wiki/Installation.md][typst-ts-mode]],

#+begin_src elisp :tangle packages.el
(package! typst-ts-mode
  :recipe (:host codeberg :repo "meow_king/typst-ts-mode"))

(package! outline-indent-mode
  :recipe (:host sourcehut :repo "meow_king/outline-indent-mode"))
#+end_src

#+begin_src elisp :tangle config.el
(use-package! typst-ts-mode
  :custom
  (typst-ts-watch-options "--open")
  (typst-ts-mode-grammar-location (expand-file-name "tree-sitter/libtree-sitter-typst.so" user-emacs-directory))
  (typst-ts-mode-enable-raw-blocks-highlight t)
  :config
  (keymap-set typst-ts-mode-map "C-c C-c" #'typst-ts-tmenu))

(use-package! outline-indent-mode
  :config
  (add-hook 'typst-ts-mode-hook #'outline-indent-mode))
#+end_src

