config.el

(use-package! org-pandoc-import :after org)
(use-package! ox-pandoc :after org)

(after! elfeed
  (setq elfeed-db-directory "~/.elfeed-data")
  (add-hook 'elfeed-search-mode-hook #'elfeed-update))


(use-package! elfeed-protocol
  :after elfeed
  :config
  (setq elfeed-curl-extra-arguments '("--insecure"))
  ;; setup feeds
  (setq elfeed-protocol-feeds '(("owncloud+https://admin@nc.mbarria.cl"
                                 :use-authinfo t )))

  ;; enable elfeed-protocol
  (setq elfeed-protocol-enabled-protocols '(fever newsblur owncloud ttrss))
  (setq elfeed-protocol-owncloud-maxsize 1000)
  (setq elfeed-protocol-owncloud-update-with-modified-time t)
  (setq elfeed-protocol-owncloud-fetch-category-as-tag t)
  (elfeed-protocol-enable)
  )

(map! :leader
      (:prefix-map ("S" . "Spotify")
       :desc "START"    "s" 'spotify-start
       :desc "Play"     "j" 'spotify-play
       :desc "Pause"    "k" 'spotify-pause
       :desc "Next"     "l" 'spotify-next
       :desc "Previous" "h" 'spotify-prev
       ))

;; Pueue
(map! :map doom-leader-open-map
      :desc "Pueue"     "q" 'pueue
      )
(map! :map doom-leader-code-map
      :desc "Add to Pueue"     "q" 'pueue-add
      )

(use-package! beacon
  :config (beacon-mode 1))

(use-package! nyan-mode
  :after doom-modeline
  :config
  (setq nyan-bar-length 15
        nyan-wavy-trail t)
  (nyan-mode)
  (nyan-start-animation))

(use-package! slurm-mode)

(use-package! gptel
  :config
  ;; (gptel-make-ollama "Ollama"             ;Any name of your choosing
  ;;   :host "localhost:11434"               ;Where it's running
  ;;   :stream t                             ;Stream responses
  ;;   :models '("llama3.1:latest"))          ;List of models
  ;; Set default
  ;; OPTIONAL configuration
  (setq
   gptel-model 'deepseek-r1
   gptel-default-mode #'org-mode
   gptel-backend (gptel-make-ollama "Ollama"
                   :host "localhost:11434"
                   :stream t
                   :models '(
                             "deepseek-r1"
                             "llama3.1:latest"
                             "deepseek-coder-v2:latest"
                             "mistral:latest"
                             "mistral-nemo:latest"
                             "gemma2:latest"
                             "gemma2:27b"))))

(map! :leader
      (:prefix-map ("l" . "gptel")
       :desc "Dedicated Buffer" "l" 'gptel
       :desc "Menu"  "m"  'gptel-menu
       :desc "Send text"  "s"  'gptel-send
       :desc "Send text (Menu)"  "S"  (cmd! (gptel-send 1))
       :desc "Add/remove region"  "a"  'gptel-add
       :desc "Add file"  "A"  'gptel-add-file
       (:mode (org-mode)
        :desc "Limit to Heading" "h" 'gptel-org-set-topic
        :desc "Set properties" "p" 'gptel-org-set-properties)))

(use-package! whisper
  :config
  (map! :desc "Voice to Text" :g "C-c i" #'whisper-run)

  (defun whisper--break-sentences (n)
    "Put a line break every N sentences."
    (catch 'return
      (while t
        (dotimes (_ n)
          (forward-sentence 1)
          (when (eobp) (throw 'return nil)))
        (insert "\n")
        (when (= (char-after) ?\ )
          (delete-horizontal-space)))))

  (add-hook 'whisper-post-process-hook
            (lambda ()
              (whisper--break-sentences 1)))

  )

(use-package! typst-ts-mode
  :custom
  (typst-ts-watch-options "--open")
  (typst-ts-mode-grammar-location (expand-file-name "tree-sitter/libtree-sitter-typst.so" user-emacs-directory))
  (typst-ts-mode-enable-raw-blocks-highlight t)
  :config
  (keymap-set typst-ts-mode-map "C-c C-c" #'typst-ts-tmenu))

(use-package! outline-indent-mode
  :config
  (add-hook 'typst-ts-mode-hook #'outline-indent-mode))
