packages.el

(package! org-pandoc-import
  :recipe (:host github
           :repo "tecosaur/org-pandoc-import"
           :files ("*.el" "filters" "preprocessors")))
(package! ox-pandoc)

(package! elfeed-dashboard)

(package! spotify
  :recipe (:host github
           :repo "SnootierMoon/emacs-spotify"))

(package! pueue
  :recipe (:host github
           :repo "xFA25E/pueue"))

(package! beacon)

(package! nyan-mode)

(package! slurm-mode)

(package! gtpel
  :recipe (:host github :repo "karthink/gptel"))

(package! typst-ts-mode
  :recipe (:host codeberg :repo "meow_king/typst-ts-mode"))

(package! outline-indent-mode
  :recipe (:host sourcehut :repo "meow_king/outline-indent-mode"))

(package! denote)
