packages.el
(package! consult-denote) ; consult integration for denote
(package! denote-explore) ; more options for exploring denote files
